InformationRegisters/ЗаключенияПоДействиямМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаключенияПоДействиямМедосмотра</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыявленыПротивопоказания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТитрСерологическогоОбследования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрохождениеМедОсмотра</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрохождениеМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействийМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исследование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИсследованийДействийМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыИсследованийДействийМедосмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнструментальноеИсследование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛабораторноеИсследование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияМедосмотра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОграниченияДействийМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьВПрограммеПрохождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляОтметкиИсследования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаключенияПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсследования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсследованийДействийМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьСКлассификатором</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗаключенияПоДействиямМедосмотра/Forms/ЗаключенияМедосмотра/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ПрохождениеМедосмотра)
		Или ТипЗнч(Параметры.Действия) <> Тип("Массив")
		Или Параметры.Действия.Количество() = 0
	Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПрохождениеМедОсмотра = Параметры.ПрохождениеМедосмотра;
	ЗаполнитьТаблицуДействий(Параметры.Действия);
	
	Если ПрохождениеМедОсмотра.ПодписанЭП Тогда
		Элементы.ДействияМедОсмотра.ТолькоПросмотр = Истина;
		Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
	КонецЕсли;
	
	Если МедосмотрыСервер.МедосмотрДляМедицинскихКнижек(Параметры.ПрохождениеМедосмотра) Тогда
		ПрохождениеМедосмотраДляМедКнижки = Истина;
	Иначе
		ПрохождениеМедосмотраДляМедКнижки = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПриемИзКоторогоОткрытаФорма) Тогда
		ПриемИзКоторогоОткрытаФорма = Параметры.ПриемИзКоторогоОткрытаФорма;
	КонецЕсли;
	
	ДействияМедосмотровЛабИсследования.ЗагрузитьЗначения(ДействияМедосмотровЛабораторныеИсследования());
	
	ДействияМедосмотровВрач.ЗагрузитьЗначения(ДействияМедосмотровВрач());
	
	// Титр доступен только для лабораторных исследований
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДействияМедОсмотраТитрСерологическогоОбследования");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияМедОсмотра.Действие");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = ДействияМедосмотровЛабИсследования;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Сотрудника можно выбрать только для действий врачей
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДействияМедОсмотраСотрудник");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДействияМедОсмотра.Действие");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = ДействияМедосмотровВрач;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКолонокТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытиемМодифицированнойФормы", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияМедОсмотра

&НаКлиенте
Процедура ДействияМедОсмотраЗаключениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДействияМедОсмотра.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Заключение) Тогда
		Элементы.ДействияМедОсмотра.ТекущиеДанные.Заключение = ТекДанные.ЗаключениеПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияМедОсмотраСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДействияМедОсмотра.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СотрудникЗаполненИзСоставаКомиссии = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияМедОсмотраПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере(ПрохождениеМедОсмотра, ДействияМедОсмотра);
	Модифицированность = Ложь;
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьИЗакрытьНаСервере(Знач ПрохождениеМедОсмотра, Знач ДействияМедОсмотра)
	
	НачатьТранзакцию();
	
	МенеджерЗаписи = РегистрыСведений.ЗаключенияПоДействиямМедосмотра.СоздатьМенеджерЗаписи();
	Для Каждого СтрокаДействия Из ДействияМедОсмотра Цикл
		Действие = СтрокаДействия.Действие;
		
		МенеджерЗаписи.Действие = СтрокаДействия.Действие;
		МенеджерЗаписи.ПрохождениеМедОсмотра = ПрохождениеМедОсмотра;
		МенеджерЗаписи.Прочитать();
		
		// Сохранение только если ввели вручную
		ВручнуюВведенныйСотрудник = Справочники.Сотрудники.ПустаяСсылка();
		Если Не ЗначениеЗаполнено(СтрокаДействия.Прием)
			И Не СтрокаДействия.СотрудникЗаполненИзСоставаКомиссии
		Тогда
			ВручнуюВведенныйСотрудник = СтрокаДействия.Сотрудник;
		КонецЕсли;
		
		ВручнуюВведеннаяДатаВыполнения = Дата(1,1,1);
		Если Не ЗначениеЗаполнено(СтрокаДействия.Прием) Тогда
			ВручнуюВведеннаяДатаВыполнения = СтрокаДействия.ДатаВыполнения;
		КонецЕсли;
		
		Если МенеджерЗаписи.Заключение <> СтрокаДействия.Заключение
				И СтрокаДействия.Заключение <> СтрокаДействия.ЗаключениеПоУмолчанию
			Или МенеджерЗаписи.ДатаВыполнения <> ВручнуюВведеннаяДатаВыполнения
			Или МенеджерЗаписи.Сотрудник <> ВручнуюВведенныйСотрудник
			Или МенеджерЗаписи.ВыявленыПротивопоказания <> СтрокаДействия.ВыявленыПротивопоказания
			Или МенеджерЗаписи.ТитрСерологическогоОбследования <> СтрокаДействия.ТитрСерологическогоОбследования
				И Не СтрокаДействия.ПротивопоказанияВыявленыВПриеме
		Тогда
			МенеджерЗаписи.Заключение = СтрокаДействия.Заключение;
			МенеджерЗаписи.Действие = СтрокаДействия.Действие;
			МенеджерЗаписи.ПрохождениеМедОсмотра = ПрохождениеМедОсмотра;
			МенеджерЗаписи.ДатаВыполнения = ВручнуюВведеннаяДатаВыполнения;
			МенеджерЗаписи.Сотрудник = ВручнуюВведенныйСотрудник;
			МенеджерЗаписи.ВыявленыПротивопоказания = СтрокаДействия.ВыявленыПротивопоказания;
			МенеджерЗаписи.ТитрСерологическогоОбследования = СтрокаДействия.ТитрСерологическогоОбследования;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДействий(СписокДействий)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДействий",СписокДействий);
	Запрос.УстановитьПараметр("ПрохождениеМедОсмотра",ПрохождениеМедОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияМедосмотра.Ссылка КАК Действие
		|ПОМЕСТИТЬ СписокДействий
		|ИЗ
		|	Справочник.ДействияМедосмотра КАК ДействияМедосмотра
		|ГДЕ
		|	ДействияМедосмотра.Ссылка В(&СписокДействий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.Заключение КАК Заключение,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.Действие КАК Действие,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ДатаВыполнения КАК ДатаВыполнения,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ВыявленыПротивопоказания КАК ВыявленыПротивопоказания,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ТитрСерологическогоОбследования КАК ТитрСерологическогоОбследования
		|ПОМЕСТИТЬ ЗаключенияПоРегистру
		|ИЗ
		|	РегистрСведений.ЗаключенияПоДействиямМедосмотра КАК ЗаключенияПоДействиямМедосмотраСрезПоследних
		|ГДЕ
		|	ЗаключенияПоДействиямМедосмотраСрезПоследних.ПрохождениеМедОсмотра = &ПрохождениеМедОсмотра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДействий.Действие КАК Действие,
		|	ЗаключенияПоРегистру.Заключение КАК Заключение,
		|	ЗаключенияПоРегистру.ДатаВыполнения КАК ДатаВыполнения,
		|	СписокДействий.Действие.ТекстЗаключенияПоУмолчанию КАК ТекстЗаключенияПоУмолчанию,
		|	ЗаключенияПоРегистру.Сотрудник КАК Сотрудник,
		|	ЗаключенияПоРегистру.ВыявленыПротивопоказания КАК ВыявленыПротивопоказания,
		|	ЗаключенияПоРегистру.ТитрСерологическогоОбследования КАК ТитрСерологическогоОбследования
		|ИЗ
		|	СписокДействий КАК СписокДействий
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаключенияПоРегистру КАК ЗаключенияПоРегистру
		|		ПО СписокДействий.Действие = ЗаключенияПоРегистру.Действие
		|
		|УПОРЯДОЧИТЬ ПО
		|	СписокДействий.Действие.Вид УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПрохождениеМедОсмотра);
	
	ДействияМедОсмотра.Очистить();
	ТекстЗаключенияПоУмолчанию	 = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	ТаблицаПараметровИЗначений	 = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПрохождениеМедОсмотра, СписокДействий);
	ПриемыПоДействиямМедосмотров = МедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПрохождениеМедОсмотра, СписокДействий);
	
	ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
	
	АктуальныйСоставМедкомиссии = МедосмотрыСерверПовтИсп.ПолучитьСоставМедкомиссии(, Истина, ПрохождениеМедОсмотра.Филиал);
	ДопустимыеДолжности230 = ИнтеграцияЕГИСЗ_СЭМД.ДопустимыеУИДЕГИСЗДолжностей230();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДействияМедОсмотра.Добавить();
		НоваяСтрока.Действие = Выборка.Действие;
		ЗаключениеПоУмолчанию = ?(ЗначениеЗаполнено(Выборка.ТекстЗаключенияПоУмолчанию),Выборка.ТекстЗаключенияПоУмолчанию,ТекстЗаключенияПоУмолчанию);
		НоваяСтрока.ЗаключениеПоУмолчанию = ЗаключениеПоУмолчанию;
		
		ОтборДействиеМедосмотра.ДействиеМедосмотра = Выборка.Действие;
		ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
		
		СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие",Выборка.Действие));
		СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
		НоваяСтрока.ЗаключениеПоУмолчанию = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, НоваяСтрока.ЗаключениеПоУмолчанию, ТаблицаПараметровДействия, Выборка.Действие.Вид);
		
		Если ЗначениеЗаполнено(Выборка.Заключение) И Выборка.Заключение <> ЗаключениеПоУмолчанию Тогда
			НоваяСтрока.Заключение = Выборка.Заключение;
		Иначе
			НоваяСтрока.Заключение = НоваяСтрока.ЗаключениеПоУмолчанию;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТитрСерологическогоОбследования) Тогда
			НоваяСтрока.ТитрСерологическогоОбследования = Выборка.ТитрСерологическогоОбследования;
		КонецЕсли;
		
		// Заполненный прием в дальнейшем перезапишет сотрудника и дату выполнения
		Если ЗначениеЗаполнено(Выборка.ДатаВыполнения) Тогда
			НоваяСтрока.ДатаВыполнения = Выборка.ДатаВыполнения;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		КонецЕсли;
		НоваяСтрока.ВыявленыПротивопоказания = Выборка.ВыявленыПротивопоказания;
		
		// Колонки далее не заполняются если это не для мед книжки 
		Если Не ЗначениеЗаполнено(ПрохождениеМедосмотраДляМедКнижки) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Прием = ПриемыПоДействиямМедосмотров.Получить(НоваяСтрока.Действие);
		
		// Дата из приема приоритетнее введенной вручную
		Если ЗначениеЗаполнено(НоваяСтрока.Прием) Тогда
			НоваяСтрока.ДатаВыполнения = НоваяСтрока.Прием.Дата;
		КонецЕсли;
		
		ДопустимыеУИДЕГИСЗДолжностей = ИнтеграцияЕГИСЗ_СЭМД.ДопустимыеУИДЕГИСЗДолжностей230();
		
		Если ТипЗнч(Выборка.Действие.СвязьСКлассификатором) = Тип("СправочникСсылка.КлассификаторыМинЗдрава")
			И Выборка.Действие.СвязьСКлассификатором.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций
		Тогда
			Если ДопустимыеУИДЕГИСЗДолжностей.Найти(Выборка.Действие.СвязьСКлассификатором.УИДЕГИСЗ) <> Неопределено Тогда
				НоваяСтрока.ТребуетсяВыделениеСотрудника = Истина;
				// Если у сотрудника есть должность для 230, то заполняем
				Если ЗначениеЗаполнено(НоваяСтрока.Прием) Тогда
					// Перезаписывает существующую запись
					НоваяСтрока.Сотрудник = НоваяСтрока.Прием.Врач;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НоваяСтрока.Сотрудник)
					И Не ЗначениеЗаполнено(НоваяСтрока.Прием)
				Тогда
					Для Каждого ЧленМедкомиссии Из АктуальныйСоставМедкомиссии Цикл
						Если Не ЗначениеЗаполнено(ЧленМедкомиссии.Должность) Тогда
							Продолжить;
						КонецЕсли;
						Если ЧленМедкомиссии.Должность.УИДЕГИСЗ = Выборка.Действие.СвязьСКлассификатором.УИДЕГИСЗ Тогда
							НоваяСтрока.Сотрудник = ЧленМедкомиссии.Сотрудник;
							НоваяСтрока.СотрудникЗаполненИзСоставаКомиссии = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьГалочкиПротивопоказанияПоПриемам(СписокПротивопоказаний);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемМодифицированнойФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЗаписатьИЗакрытьНаСервере(ПрохождениеМедОсмотра, ДействияМедОсмотра);
		Закрыть(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокТаблицы()
	Если Не ПрохождениеМедосмотраДляМедКнижки Тогда
		Элементы.ДействияМедОсмотраВыявленыПротивопоказания.Видимость = Ложь;
		Элементы.ДействияМедОсмотраСотрудник.Видимость = Ложь;
		Элементы.ДействияМедОсмотраПриём.Видимость = Ложь;
		Элементы.ДействияМедОсмотраТитрСерологическогоОбследования.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьГалочкиПротивопоказанияПоПриемам(СписокПротивопоказаний)
	
	ФакторыМедкнижки = МедосмотрыСервер.ПунктыВредныхФакторовДляМедкнижки();
	Для Каждого Действие Из ДействияМедОсмотра Цикл
		// Прием выполняет больше одного действия или не выполняет действий
		Если ДействияМедОсмотра.НайтиСтроки(Новый Структура("Прием", Действие.Прием)).Количество() <> 1 Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем противопоказание для фактора медкнижки
		СтрокиПротивопоказаний = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", Действие.Действие));
		Для Каждого СтрокаПротивопоказания Из СтрокиПротивопоказаний Цикл
			Если СтрокаПротивопоказания.ВредныйФактор.Приказ = Справочники.ПриказыМедосмотров.Приказ29н 
				И ФакторыМедкнижки.Найти(СтрокаПротивопоказания.ВредныйФактор.НомерПП) <> Неопределено
			Тогда
				Действие.ВыявленыПротивопоказания = Истина;
				Действие.ПротивопоказанияВыявленыВПриеме = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДействияМедосмотровЛабораторныеИсследования()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДействияМедосмотра.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ДействияМедосмотра КАК ДействияМедосмотра
	                |ГДЕ
	                |	ДействияМедосмотра.Вид = &Вид
	                |	И ДействияМедосмотра.ВидИсследования = &ВидИсследования";
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование);
	Запрос.УстановитьПараметр("ВидИсследования", Перечисления.ВидыИсследованийДействийМедосмотра.ЛабораторноеИсследование);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Возврат Результат.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДействияМедосмотровВрач()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДействияМедосмотра.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ДействияМедосмотра КАК ДействияМедосмотра
	                |ГДЕ
	                |	ДействияМедосмотра.Вид = &Вид";
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДействийМедицинскогоОсмотра.Врач);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Возврат Результат.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

#КонецОбласти
